nxp-appcodehub/dm-mcxn947-power-manager/components/power_manager/core/fsl_pm_core.h
    uint8_t powerModeConstraint;                         /*!< Used to store system allowed lowest power mode. */
    uint8_t powerModeConstraintCount[PM_LP_STATE_COUNT]; /*!< The count of each power mode constraint. */

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
    list_label_t notifyList[3U];           /*!< The header of 3 group notification. */
    pm_notify_group_t curNotifyGroup;      /*!< Store current notification group. */
    pm_notify_element_t *curNotifyElement; /*!< Store current notification element. */
#endif                                     /* FSL_PM_SUPPORT_NOTIFICATION */

#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
    pm_low_power_timer_start_func_t timerStart; /*!< If RTOS supports tickless, start low power timer before entering
                                                     low power mode. */
    pm_low_power_timer_stop_func_t timerStop; /*!< If RTOS supports tickless, stop low power timer after waking up from
                                                   low power mode. */
    pm_low_power_timer_get_timestamp_func_t getTimestamp; /*!< This function is used to get a timestamp before and after
                                                               low power mode to be able to compute the duration */
    pm_low_power_timer_get_duration_func_t getTimerDuration; /*!< This function can be used to retrun the actual
                                                                  low power duration based on the entry/exit timestamps */
    uint64_t entryTimestamp;
    uint64_t exitTimestamp;
#endif                                                 /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
    list_label_t wakeupSourceList;
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

    pm_enter_critical enterCritical; /* Power manager critical entry function, default set as NULL. */
    pm_exit_critical exitCritical;   /* Power manager critical exit function, default set as NULL. */
} pm_handle_t;

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @name Power Manager Policy
 * @{
 */

/*!
 * @brief Initialize the power manager handle, this function should be invoked before using other power manager
 * APIs.
 *
 * @note In default, the power manager is disabled.
 *
 * @param handle Pointer to the @ref pm_handle_t structure, upper layer software should pre-allocate the handle global
 * variable.
 */
void PM_CreateHandle(pm_handle_t *handle);

/*!
 * @brief Enable/disable power manager functions.
 *
 * @param enable Used to enable/disable power manager functions.
 */
void PM_EnablePowerManager(bool enable);

/*!
 * @brief Power manager core API, this API should be used on RTOS's IDLE task.
 *
 * This function contains several steps:
 * 1. Compute target power state based on the policy module.
 * 2. Notify upper layer software of the power mode entering.
 * 3. Enter into target power state.
 * 4. Exit from low power state, if wakeup event occurred.
 * 5. Notify upper layer software of the power mode exiting.
 *
 * The target power state is determined based on two factors:
 *   a. The input parameter should be larger than state's exitLatency attribution.
 *   b. resConstraintsMask logical AND state's lossFeature should equal to 0, because constraint can be understand as
 * some features can not loss.
 *
 * @param duration The time in low power mode, this value is calculate from RTOS API.
 */
void PM_EnterLowPower(uint64_t duration);

#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
/*!
 * @brief Register timer controller related functions to power manager.
 *
 * If low power timer is the wakeup source, please remember to register it into power manager by using
 * PM_RegisterWakeupSource() function.
 *
 * @param handle Pointer to the @ref pm_handle_t structure
 * @param timerStart Low power timer start function, this parameter can be NULL, and it means low power timer is not set
 *  as the wakeup source.
 * @param timerStop Low power timer stop function, this parameter can also be set as NULL.
 * @param timerSync Low power timer sync function, this parameter can also be set as NULL.
 * @param getTimestamp Low power timestamp function, this parameter can also be set as NULL.
 * @param getTimerDuration Get timer duration function. this parameter can also be set as NULL.
 */
void PM_RegisterTimerController(pm_handle_t *handle,
                                pm_low_power_timer_start_func_t timerStart,
                                pm_low_power_timer_stop_func_t timerStop,
                                pm_low_power_timer_get_timestamp_func_t getTimestamp,
                                pm_low_power_timer_get_duration_func_t getTimerDuration);

/*!
 * @brief Get the actual low power state duration.
 */
uint64_t PM_GetLastLowPowerDuration(void);
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

/*!
 * @brief Register critical region related functions to power manager.
 *
 * @note There are multiple-methods to implement critical region(E.g. interrupt controller, locker, semaphore).
 *
 * @param handle Pointer to the @ref pm_handle_t structure
 * @param criticalEntry Enter critical function to register.
 * @param criticalExit  Exit critical function to register.
 */
void PM_RegisterCriticalRegionController(pm_handle_t *handle,
                                         pm_enter_critical criticalEntry,
                                         pm_exit_critical criticalExit);

/*! @} */

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
/*!
 * @name Notification Module Interfaces
 * @{
 */

/*!
 * @brief Register notify element into the selected group.
 *
 * @param groupId The group of the notify list, this will affect the execution sequence.
 * @param notifyElement The pointer to @ref pm_notify_element_t.
 * @return status_t The status of register notify object behavior.
 */
status_t PM_RegisterNotify(pm_notify_group_t groupId, pm_notify_element_t *notifyElement);

/*!
 * @brief Update notify element's callback function and application data.
 *
 * @param notifyElement The pointer to the notify element to update.
 * @param callback The callback function to be updated.
 * @param data Pointer to the callback function private data.
 */
void PM_UpdateNotify(void *notifyElement, pm_notify_callback_func_t callback, void *data);

/*!
 * @brief Remove notify element from its notify group.
 *
 * @param notifyElement The pointer to the notify element to remove.
 */
status_t PM_UnregisterNotify(void *notifyElement);

/* @} */
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
/*!
 * @name Wakeup Source Manager Interfaces
 * @{
 */

/*!
 * @brief Initialize the wakeup source object.
 *
 * @param ws    Pointer to the @ref pm_wakeup_source_t variable.
 * @param wsId  Used to select the wakeup source, the wsId of each wakeup source can be found in fsl_pm_board.h
 * @param service The function to be invoked when wake up source asserted.
 * @param enable Used to enable/disable the selected wakeup source.
 */
void PM_InitWakeupSource(pm_wakeup_source_t *ws, uint32_t wsId, pm_wake_up_source_service_func_t service, bool enable);

/*!
 * @brief Enable wakeup source.
 *
 * @param ws Pointer to the wakeup source object to be enabled.
 * @return status_t The status of enable wakeup source behavior.
 */
status_t PM_EnableWakeupSource(pm_wakeup_source_t *ws);

/*!
 * @brief Disable wakeup source
 *
 * @param ws Pointer to the wakeup source object to be disabled.
 * @return status_t The status of disable wakeup source behavior.
 */
status_t PM_DisableWakeupSource(pm_wakeup_source_t *ws);

/*!
 * @brief Checks if any enabled wake up source is responsible for last wake up
 *       event. In such case, it will call the wake up source callback if it
 *       has been registered. Likely to be called from Wake Up Unit IRQ Handler.
 *
 * @return status_t The status of handling the wake up event.
 */
status_t PM_HandleWakeUpEvent(void);

/*!
 * @brief If the specfic wakeup event occurs, invoke this API to execute its service function.
 *
 * @param ws Pointer to the wakeup source object.
 * @return status_t The status of trigger wakeup source behavior.
 */
status_t PM_TriggerWakeSourceService(pm_wakeup_source_t *ws);
/*! @} */
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*!
 * @name Constraints Interfaces
 * @{
 */

/*!
 * @brief Used to set constraints(including power mode constraint and resource constraints)
 *
 * For example, if the board support 3 resource constraints: PM_RESC_1, PM_RESC_2, PM_RESC3
 *  @code
 *      PM_SetConstraints(Sleep_Mode, 3, PM_RESC_1, PM_RESC_2, PM_RESC_3);
 *  @endcode
 *
 * @param powerModeConstraint The lowest power mode allowed, the power mode constraint macros
 *                            can be found in fsl_pm_board.h
 * @param rescNum The number of resource constraints to be set.
 * @return status_t The status of set constraints behavior.
 */
status_t PM_SetConstraints(uint8_t powerModeConstraint, int32_t rescNum, ...);

/*!
 * @brief Used to release constraints(including power mode constraint and resource constraints)
 *
 * For example, if the board support 3 resource constraints: PM_RESC_1, PM_RESC_2, PM_RESC3
 *  @code
 *      PM_ReleaseConstraints(Sleep_Mode, 1, PM_RESC_1);
 *  @endcode
 *
 * @param powerModeConstraint The lowest power mode allowed, the power mode constraint macros
 *                            can be found in fsl_pm_board.h
 * @param rescNum The number of resource constraints to be released.
 * @return status_t The status of set constraints behavior.
 */
status_t PM_ReleaseConstraints(uint8_t powerModeConstraint, int32_t rescNum, ...);

/*!
 * @brief Get current system resource constraints.
 *
 * @return Current system constraints.
 */
pm_resc_mask_t PM_GetResourceConstraintsMask(void);

/*!
 * @brief Get current system allowed power mode.
 *
 * @return Allowed lowest power mode.
 */
uint8_t PM_GetAllowedLowestPowerMode(void);

/*!
 * @brief Finds the Deepest power state allowed by the current
 * constraints.  Returns a structure that caller can use to
 * determine why this is deepest state allowed.
 *
 * @param duration input the duration to stay in low-power state
 * @param results output pointer to structure for caller:
 *          - deepestState: allowed lowest power mode
 *          - reason: why deeper mode was not allowed
 *          - resc_num: if reason == kPM_reason_resc, resc number that blocked deeper mode
 */
void PM_findDeepestState(uint64_t duration, pm_deepest_state_results_t *results);

/* @} */

#if defined(__cplusplus)
}
#endif
/*!
 * @}
 */

#endif /* _FSL_PM_CORE_H_ */